[
    {
        "name": "React",
        "proficiency": 0.9,
        "category": "Frontend",
        "description": "React has been my frontend framework of choice for the last few years. I have experience with both class-based and functional components, as well as hooks. I have also worked with Redux and Context API for state management.",
        "projects": [
            {
                "name": "This website",
                "description": "The website you're currently on was built with React."
            }
        ],
        "experience": 4,
        "relatedSkills": ["Next.js"],
        "logo": "react.svg"
    },
    {
        "name": "Next.js",
        "proficiency": 0.7,
        "category": "Frontend",
        "description": "I have recently been using Next.js for a number of projects. I like how it can simplify the process of building an application and abstract away some of the more tedious parts of setting up a React app.",
        "projects": [
            {
                "name": "This website",
                "description": "This website was built with Next.js."
            }
        ],
        "experience": 2,
        "relatedSkills": ["React"],
        "logo": "nextjs.svg"
    },
    {
        "name": "Node.js",
        "proficiency": 0.8,
        "category": "Backend",
        "description": "Node.js is my backend runtime of choice. Most of the time, I've used it with Express, but I've also worked with Fastify. I also have experience using it to build RESTful APIs and GraphQL servers.",
        "projects": [
            {
                "name": "Mock My Draft",
                "description": "The backend for Mock My Draft was built with Node.js."
            }
        ],
        "experience": 4,
        "relatedSkills": ["Express"],
        "logo": "node.svg"
    },
    {
        "name": "MongoDB",
        "proficiency": 0.5,
        "category": "Databases",
        "description": "MongoDB is the database I've used the most. I have experience with both the native MongoDB driver and Mongoose. I've used it to build RESTful APIs and GraphQL servers.",
        "projects": [
            {
                "name": "Mock My Draft",
                "description": "The database for Mock My Draft was built with MongoDB."
            }
        ],
        "experience": 3,
        "relatedSkills": ["Express"],
        "logo": "mongodb.svg"
    },
    {
        "name": "Express",
        "proficiency": 0.8,
        "category": "Backend",
        "description": "Express is the backend framework I've used the most. I have experience building RESTful APIs and GraphQL servers with it.",
        "projects": [
            {
                "name": "Mock My Draft",
                "description": "The backend for Mock My Draft was built with Express."
            }
        ],
        "experience": 4,
        "relatedSkills": ["Node.js"],
        "logo": "express.svg"
    },
    {
        "name": "JavaScript",
        "proficiency": 0.9,
        "category": "Languages",
        "description": "JavaScript is the language I've used the most. I have experience with both ES5 and ES6, as well as TypeScript. I've used it to build frontend and backend applications.",
        "experience": 6,
        "relatedSkills": ["TypeScript", "React", "Node.js"],
        "logo": "javascript.svg"
    },
    {
        "name": "TypeScript",
        "proficiency": 0.8,
        "category": "Languages",
        "description": "TypeScript is the language I've used the most in the last few years. I have experience with both frontend and backend applications.",
        "experience": 4,
        "relatedSkills": ["JavaScript"],
        "logo": "typescript.svg"
    },
    {
        "name": "Golang",
        "proficiency": 0.3,
        "category": "Languages",
        "description": "Golang is a language I've used sparingly, but I have experience building/maintaining a service using it from my time at Qualtrics.",
        "projects": [
            {
                "name": "A component registry service",
                "description": "While at Qualtrics, I built and maintained a service that acted as a registry for components used in the platform."
            }
        ],
        "experience": 1,
        "logo": "go.svg"
    },
    {
        "name": "Python",
        "proficiency": 0.6,
        "category": "Languages",
        "description": "Python is a language I've used for a few projects. I used it quite a bit a few years ago. While at Qualtrics, I built an image comparison library for testing purposes in Python. More recently, I picked it up again to build a text analysis service.",
        "projects": [
            {
                "name": "Image comparison library",
                "description": "While at Qualtrics, I built an image comparison library for testing purposes in Python."
            },
            {
                "name": "Text analysis service",
                "description": "I recently built a text analysis service in Python."
            }
        ],
        "experience": 3,
        "logo": "python.svg"
    },
    {
        "name": "Docker",
        "proficiency": 0.4,
        "category": "DevOps",
        "description": "Docker is a tool I've used for a few projects. I have experience building and running containers. I've also used it to build multi-container applications, such as a full-stack applications with multiple backend services, multiple frontend apps, and a database.",
        "projects": [
            {
                "name": "Mock My Draft",
                "description": "My recent project Mock My Draft is built with a handful of services running in Docker containers."
            },
            {
                "name": "Qualtrics, assorted projects",
                "description": "Most projects I worked on while at Qualtrics used Docker for deployment"
            }
        ],
        "experience": 2,
        "logo": "docker.svg"
    },
    {
        "name": "Git",
        "proficiency": 0.85,
        "category": "DevOps",
        "description": "Git is the version control system I've used the most. I have experience with both GitHub and GitLab (and even BitBucket once upon a time). I've used it for both personal and professional projects.",
        "projects": [
            {
                "name": "Everything",
                "description": "I've used Git for basically every software project I've worked on."
            }
        ],
        "experience": 6,
        "logo": "git.svg"
    },
    {
        "name": "Jest",
        "proficiency": 0.6,
        "category": "Testing",
        "description": "Jest is the testing framework I've used the most for recent projects. I have experience writing unit tests and integration tests with it.",
        "experience": 4,
        "logo": "jest.svg"
    },
    {
        "name": "Vue",
        "proficiency": 0.65,
        "category": "Frontend",
        "description": "Vue is a frontend framework I've used for a few projects, although not as much recently.",
        "projects": [
            {
                "name": "Polititrack",
                "description": "The frontend for polititrack was built using Vue."
            },
            {
                "name": "A small website for a dog breeder"
            }
        ],
        "experience": 3,
        "logo": "vue.svg"
    },
    {
        "name": "D3.js",
        "proficiency": 0.75,
        "category": "Data Visualization",
        "description": "D3.js has been my go to library for data visualization over the last several years. I used it extensively in my time at Qualtrics to build a visualization library that was used by many teams and enabled the platform's reporting capabilities.",
        "projects": [
            {
                "name": "DQ",
                "description": "During my time at Qualtrics, I helped to build & maintain an in-house data visualization library that was used by many teams and enabled the platform's reporting capabilities."
            },
            {
                "name": "This website",
                "description": "This skill visualization was built in part with DQ."
            }
        ],
        "experience": 4.5,
        "logo": "d3.svg"
    },
    {
        "name": "PostgreSQL",
        "proficiency": 0.4,
        "category": "Databases",
        "description": "I've used SQL for a few projects when they've called for relational databases. I have experience writing queries and building schemas.",
        "experience": 2,
        "logo": "postgresql.svg"
    },
    {
        "name": "Rust",
        "proficiency": 0.2,
        "category": "Languages",
        "description": "Rust is a language I haven't used much, but I've been learning it in my free time. I hope to use it for a project in the near future.",
        "experience": 1,
        "logo": "rust.svg"
    },
    {
        "name": "Svelte",
        "proficiency": 0.3,
        "category": "Frontend",
        "description": "Svelte is a frontend framework I've used occasionally in recent years for very small personal projects. I especially like how well it works for data visualization.",
        "experience": 1,
        "logo": "svelte.svg"
    },
    {
        "name": "Elm",
        "proficiency": 0.2,
        "category": "Frontend",
        "description": "Elm is a frontend language I've used a little bit. I like the functional programming paradigm it uses, but I haven't used it much in recent years. I would love to explore using it for a larger scale project in the future.",
        "experience": 1,
        "logo": "elm.svg"
    }
]
